src/InformationRegisters/ОтслеживаниеПосещений/ОтслеживаниеПосещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтслеживаниеПосещений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Страница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>IP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>UID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/HTTPServices/Ping/Module.bsl
#Область ОбработчикиСобытий

Функция returnStatusget(Запрос)
	
	Источник 	= Запрос.Заголовки.Получить("Athenaeum-Source");
	IP			= Запрос.Заголовки.Получить("X-Forwarded-For");
	
	МЗ = РегистрыСведений.ОтслеживаниеПосещений.СоздатьМенеджерЗаписи();
	МЗ.UID	 	= Строка(Новый УникальныйИдентификатор);
	МЗ.Период 	= ТекущаяДатаСеанса();
	МЗ.Страница	= Строка(Источник);
	МЗ.IP		= Строка(IP);
	МЗ.Записать();
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции

Функция returnStatuscors(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

#КонецОбласти
